app/controllers/routes_controller.rb

    def index
        # get route data from MBTA API
        routes_response = RestClient.get("https://api-v3.mbta.com/routes?filter[type]=0,1&api_key=#{ENV['MBTA_KEY']}")

        routes_data = JSON.parse(routes_response)["data"]

        # Create Routes from the parsed data
        routes_data.map do |route|
            Route.create(name: route["attributes"]["long_name"], mbta_id: route["id"])
        end

        # Display the route names at path /routes
        @routes = Route.all.map{ |route| route.name }
---
INSERT INTO "routes" ("name", "created_at", "updated_at", "mbta_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Red Line"], ["created_at", "2020-03-07 18:48:38.235069"], ["updated_at", "2020-03-07 18:48:38.235069"], ["mbta_id", 0]]
SELECT  "routes".* FROM "routes" ORDER BY "routes"."id" ASC LIMIT $1  [["LIMIT", 1]]