app/views/routes/index.html.erb

SELECT "stops".* FROM "stops" INNER JOIN "route_stops" ON "stops"."id" = "route_stops"."stop_id" WHERE "route_stops"."route_id" = $1  [["route_id", 9]]
SELECT COUNT(*) FROM "stops" INNER JOIN "route_stops" ON "stops"."id" = "route_stops"."stop_id" WHERE "route_stops"."route_id" = $1  [["route_id", 9]]
---
<h2>Subway Route with the most stops</h2>
<%= @most.name %> - <%= @most.stops.size %> stops

SELECT  "routes".* FROM "routes" INNER JOIN "route_stops" ON "routes"."id" = "route_stops"."route_id" WHERE "route_stops"."stop_id" = $1 AND "routes"."id" = $2 LIMIT $3  [["stop_id", 10], ["id", 1], ["LIMIT", 1]]
---
            <ul>
                <% stop.routes[0..-2].each do |r| %>