app/views/application/index.html.erb

  <%= label_tag(:first_stop, "Search for:") %>
  <%= collection_select(:stop_1, :stop_id, Stop.all, :id, :name) %>
---
SELECT "stops".* FROM "stops"